# ==============================================
# مشروع تعريب الأوامر - الإصدار 0.1
# أوامر التنقل والاستكشاف
# فوزي المزجاجي - صدقة جارية
# ==============================================

# أوامر التنقل والاستكشاف
alias 'اين-انا'='pwd'
alias 'انتقل'='cd'
alias 'ارجع'='cd -'
alias 'اعرض'='ls'
alias 'اعرض-مخفي'='ls -a'
alias 'اعرض-تفصيل'='ls -l'
alias 'اعرض-كامل'='ls -la'
alias 'اعرض-حجم'='ls -lh'
alias 'اعرض-ممتد'='ls -R'
alias 'اعرض-زمني'='ls -lt'
alias 'اعرض-زمني-عكسي'='ls -ltr'
alias 'اعرض-كبير'='ls -lS'
alias 'نوع-الملف'='file'
alias 'تصفح'='less'
alias 'نوع'='type'
alias 'اين'='which'
alias 'مساعدة'='help'

# أمر إضافي لسرد الأوامر العربية المتاحة
alias 'اوامري'='grep "^alias" ~/arabic_commands/aliases.sh | sed "s/alias //g" | cut -d "=" -f1'
